# FamilyOverconstraint Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..FamilyFailures..::..FamilyOverconstraint Property
BuiltInFailures..::..FamilyFailures Class See Also
---
Dimension overconstrains the Family. Cannot set Family Type to <None>.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FamilyOverconstraint { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FamilyOverconstraint As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FamilyOverconstraint {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..FamilyFailures Class
Autodesk.Revit.DB Namespace